// 面试题 08.11. 硬币
// 硬币。给定数量不限的硬币，币值为25分、10分、5分和1分，
// 编写代码计算n分有几种表示法。(结果可能会很大，你需要将结果模上1000000007)
// 示例1:
//  输入: n = 5
//  输出：2
//  解释: 有两种方式可以凑成总金额:
// 5=5
// 5=1+1+1+1+1
// 示例2:
//  输入: n = 10
//  输出：4
//  解释: 有四种方式可以凑成总金额:
// 10=10
// 10=5+5
// 10=5+1+1+1+1+1
// 10=1+1+1+1+1+1+1+1+1+1
// 一、一维dp法
let waysToChange = (n) => {
  let dp = new Array(n + 1).fill(1);
  let coins = [1, 5, 10, 25];
  for (let i = 1; i < 4; i++) {
    for (let j = 1; j <= n; j++) {
      if (j - coins[i] >= 0) {
        dp[j] = (dp[j] + dp[j - coins[i]]) % (1e9 + 7);
      }
    }
  }
  return dp[n];
};
